---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.NoTargetsForDependentViewPropagation
source: html/dc48880c-3087-7aa2-3016-a20c025daeef.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.NoTargetsForDependentViewPropagation Property

There are no valid views. Only views without dependents can be used.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoTargetsForDependentViewPropagation { get; }
```